app/controllers/admin/sliders_controller.rb

SELECT "sliders".* FROM "sliders"
---
  def index
    @sliders = Slider.all

INSERT INTO "sliders" ("name", "descriptiong", "descriptiond", "picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at", "published", "published_from", "published_to", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @slider = Slider.new(slider_params)

    respond_to do |format|
      if @slider.save

UPDATE "sliders" SET "published_from" = ?, "published_to" = ?, "updated_at" = ? WHERE "sliders"."id" = ?  [["published_from", "2016-03-07 00:00:00.000000"], ["published_to", "2016-03-05 00:00:00.000000"], ["updated_at", "2016-03-07 16:47:51.047858"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @slider.update(slider_params)

DELETE FROM "sliders" WHERE "sliders"."id" = ?  [["id", 3]]
---
  def destroy
    @slider.destroy

SELECT  "sliders".* FROM "sliders" WHERE "sliders"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_slider
      @slider = Slider.find(params[:id])