app/controllers/sliders_controller.rb

SELECT "sliders".* FROM "sliders" WHERE (DateTime(published_from) < '2016-03-07 15:56:29.281674' AND DateTime(published_to) > '2016-03-07 15:56:29.281690' AND published == 't')
---
  def index
    @sliders = Slider.all